// Напишите программу, которая на вход принимает число и выдает яляется ли число четным

int N = 11;

if (N % 2 == 0)
    {
    Console.Write("Число является четным");
    }
else
    {
    Console.Write("Число является НЕчетным");
    }