// Напишите программу, которая на вход принимает 2 числа и выдает какое число меньшее, а какое большее

int A = 5;
int B = 17;

if (A > B)
    {
    Console.Write("A - наибольшее число");
    }
else
    {
    Console.Write("A - наименьшее число");
    }